In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv("atlantis_citizens_final.csv")
df.head()

,Citizen_ID,Diet_Type,District_Name,Occupation,Wealth_Index,House_Size_sq_ft,Life_Expectancy,Vehicle_Owned,Work_District,Bio_Hash
0,CIT_15935,Exotic Imports,Coral Slums,Scribe,1491.0,100.0,42.0,Fin Bicycle,Mariana Plaza,b81cb8ce
1,CIT_11623,Seafood,Coral Slums,Fisher,1596.0,100.0,49.0,Sea Scooter,Deep Trench,72f48eef
2,CIT_8026,Seafood,Mariana Plaza,Warrior,3921.0,533.0,37.0,Sea Scooter,Deep Trench,0abde296
3,CIT_0492,Exotic Imports,Deep Trench,Fisher,NaN,136.0,38.0,Fin Bicycle,Deep Trench,8055fc9e
4,CIT_0275,Seaweed,Deep Trench,Warrior,25985.0,2673.0,54.0,Sea Scooter,Deep Trench,c77829e2

In [3]:
df.shape

(15751, 10)

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15751 entries, 0 to 15750
Data columns (total 10 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Citizen_ID        15751 non-null  object
 1   Diet_Type         15751 non-null  object
 2   District_Name     15751 non-null  object
 3   Occupation        15751 non-null  object
 4   Wealth_Index      14696 non-null  float64
 5   House_Size_sq_ft  14554 non-null  float64
 6   Life_Expectancy   15137 non-null  float64
 7   Vehicle_Owned     15751 non-null  object
 8   Work_District     15751 non-null  object
 9   Bio_Hash          15751 non-null  object
dtypes: float64(3), object(7)
memory usage: 1.2+ MB

In [5]:
df.describe()

        Wealth_Index  House_Size_sq_ft  Life_Expectancy
count   14696.000000      14554.000000     15137.000000
mean     9529.708628       1417.153772        51.913391
std     20502.182375       2233.194323        16.567063
min      1000.000000        100.000000        20.000000
25%      1978.000000        205.000000        40.000000
50%      3794.500000        477.000000        49.000000
75%      8951.500000       1470.750000        60.000000
max    589377.000000      10000.000000       110.000000

In [6]:
missing = df.isna().sum()
missing[missing > 0]

Wealth_Index        1055
House_Size_sq_ft    1197
Life_Expectancy      614
dtype: int64

In [7]:
num_columns = df.select_dtypes(include=['int64','float64']).columns
cat_columns = df.select_dtypes(include=['object']).columns

In [ ]:
commuters = df[df["District_Name"] != df["Work_District"]]

commuters_per_district = (
    commuters.groupby("District_Name")["Bio_Hash"]
    .nunique()
    .reset_index(name="Commuting_Out_Count")
)

In [ ]:
print(df["House_Size_sq_ft"].corr(df["Life_Expectancy"]))
#correlation b/w house size and life interval

In [ ]:
df["Wealth_Index"].corr(df["Life_Expectancy"])
#correlation b/w wealth and life interval

In [9]:
df.groupby("District_Name")["Wealth_Index"].mean()
#distribution of income based on districts

District_Name
Coral Slums         3371.414207
Deep Trench         4806.795825
Mariana Plaza       8535.553804
The Golden Reef    18726.909656
Name: Wealth_Index, dtype: float64

In [10]:
df.groupby(["District_Name", "Occupation"])["Occupation"].count()
#distribution of work in different districts

District_Name    Occupation
Coral Slums      Fisher         925
                 Merchant       293
                 Miner         1275
                 Scribe         308
                 Warrior        325
Deep Trench      Fisher        1419
                 Merchant       516
                 Miner          458
                 Scribe         486
                 Warrior       1817
Mariana Plaza    Fisher         314
                 Merchant       306
                 Miner          324
                 Scribe        1259
                 Warrior        915
The Golden Reef  Fisher         478
                 Merchant      2420
                 Miner          971
                 Scribe         468
                 Warrior        474
Name: Occupation, dtype: int64

In [ ]:
df.groupby("Occupation")["Life_Expectancy"].median()
#to see how occupation affects the life expectancy

In [ ]:
df["Bio_Hash"].duplicated().sum()
#indentifying duplicate values in the data